app/controllers/articles_controller.rb

INSERT INTO `articles` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2014-08-26 00:43:54', 'test', 'primer post', '2014-08-26 00:43:54')
---
	def create
		@article = Article.new(article_params)

 		if @article.save

SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `title` = 'BootStrap', `updated_at` = '2014-08-26 21:54:33' WHERE `articles`.`id` = 3
---
	def update
	  @article = Article.find(params[:id])

	  if @article.update(article_params)