app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`article_id`, `body`, `commenter`, `created_at`, `updated_at`) VALUES (2, 'comentario test', 'Pedro', '2014-08-27 01:13:58', '2014-08-27 01:13:58')
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)